<?php
$test="¹ú Ò» ¶« À´ ¡¡ ¸å ½¨ µÚ Ôó ÒÔ ²á ÎÄ Ã«

½¨ ¹ú ÒÔ À´ Ã« Ôó ¶« ÎÄ ¸å
Ò»¾ÅËÄ¾ÅÄê¾ÅÔÂ¡ª¡ª Ò»¾ÅÎå¡ðÄêÊ®¶þÔÂ

Ä¿¡¡¡¡Â¼
ÔÚ ¡¶ÖÐ¹úÈËÃñÕþÖÎÐ-ÉÌ»áÒé¹²Í¬¸ÙÁì¡· Æð²Ý¹ý £¨ Ò»¾ÅËÄ¾ÅÄê¾ÅÔÂ£© ¡¡³ÌÖÐµÄÅúÓï ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £± £¨ Ò»¾ÅËÄ¾ÅÄê¾ÅÔÂ¶þÊ®Ò»ÈÕ£© ¡-¡-¡-¡-¡- £´ ÖÐ¹úÈËÃñÕ¾ÆðÀ´ÁË ¹ØÓÚ×éÖ¯²¿·ÖÕþÐ-´ú±í·¢ÑÔ¸øÖÜ¶÷À´µÄÐÅ £¨ Ò»¾ÅËÄ¾ÅÄê¾ÅÔÂ¶þÊ®ÁùÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £¹ £¨ Ò»¾ÅËÄ¾ÅÄê¾ÅÔÂÈýÊ®ÈÕ£© ¡-¡-¡-¡-¡- £± ÖÐ¹úÈËÃñ´óÍÅ½áÍòËê £°
£¨ Ò»¾ÅËÄ¾ÅÄê¾ÅÔÂÈýÊ®ÈÕ£© ¡-¡-¡-¡-¡-¡-¡- £± £³ ÈËÃñÓ¢ÐÛÓÀ´¹²»Ðà ÖÐ»ªÈËÃñ¹²ºÍ¹úÖÐÑëÈËÃñÕþ¸®¹«¸æ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÒ»ÈÕ£©¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £± £´ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÒ»ÈÕ£©¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £± ¸øÇÈ°ûµÄÌâ´Ê £¶ ¹ØÓÚÖÐËÕ½¨½»µÄÐÂÎÅ¸å £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂ ÈýÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £± £·

¹ØÓÚ³ÂÃ÷ÈÊ²¿Õû±àÎÊÌâ¸øÁÖ±ë¡¢ »ªÖÐ¾ÖµÄµç±¨
£¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÎåÈÕ£©¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £± £¹ ÔÚÂíÐðÂ×Çë¼ÙÐÅÉÏµÄÅúÓï £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÎåÈÕ£©¡-¡-¡-¡-¡- £² £² £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÎåÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡- £² ¸ø»ÆÑ×ÅàµÄÐÅ £³ ´ðÐ»¸£Ë¹ÌØ¡¢ µ«ÄáË¹×£ºØÖÐ»ªÈËÃñ¹²ºÍ¹ú £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÁùÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡- £² ¡¡³ÉÁ¢µÄµç±¨ £´ £±

¾üÎ¯¹ØÓÚÍ¬ÒâÎå¸ö¾ü¿¿Â£×÷Õ½¸øÁÖ±ëµÈµÄµç±¨ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÆßÈÕ£©¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £² £¶ ÖÐÑë¹ØÓÚÎüÊÕµ³ÍâÈËÊ¿²Î¼Ó¹ãÖÝ¾ü¹Ü»áµÈ
£¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÆßÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡- £² ¡¡»ú¹¹µÄµç±¨ £¸ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂ ×ª·¢Õã½-Ê¡Î¯¹¤×÷±¨¸æµÄÅúÓï ÆßÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £² £¹ £¨ Ò»¾ÅËÄ¾ÅÄê ¹ØÓÚÑî¿ªÖÇµÈ¹¤×÷°²ÅÅÎÊÌâµÄµç±¨ Ê®ÈÕ¾ÅÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £³ £² £¨ Ò»¾ÅËÄ¾Å ¾üÎ¯¹ØÓÚ¾Û¼ß°×³çìûÖ÷Á¦¸øÁÖ±ëµÈµÄµç±¨ ÄêÊ®ÔÂÊ®ÈÕ£© £´ ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £³

Ã«Ôó¶«¡¢ ÖìµÂ¸ø ¡°³¤ÖÎ¡± ºÅ½¢È«ÌåÆðÒåÈËÔ±µÄµç±¨ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÈÕ£©¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £³ £¶ ¶ÔÐÂ½®ÕÔÎý¹â¡¢ °ü¶ûºº¡¢ ÂíÁ¼¿¥µÈ×£ºØÖÐÑëÈËÃñÕþ¸®
£¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÈÕ¡¢ ¶þÊ®Ò»ÈÕ£© ¡¡³ÉÁ¢µÄ¸´µç £· ¡-¡-¡-¡-¡- £³ £¨ Ò»¾ÅËÄ¾ÅÄê ¹ØÓÚÍ¬ÒâÔ¼°ü¶ûººÖÁ¾ÆÈªÉÌÌ¸µÄµç±¨ Ê®ÔÂÊ®Ò»ÈÕ£© £¹ ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £³

¾üÎ¯¹ØÓÚÊ®°Ë±øÍÅÓÉºØÁúÍ³ÂÊÈë´¨µÄµç±¨ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®Ò»ÈÕ£©¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £´ £° ¾üÎ¯¹ØÓÚÊ®Îå±øÍÅÔÝ²»½ø¹¥¹ãÖÝµÄµç±¨ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®Ò»ÈÕ£©¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £´ £²
£¨ Ò»¾ÅËÄ¾ÅÄê ¹ØÓÚÎ§¼ß°×³çìûÖ÷Á¦¸øÁÖ±ëµÄµç±¨ Ê®ÔÂÊ®¶þÈÕ£© £´ ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £´ £¨ Ò»¾ÅËÄ¾ÅÄê ¹ØÓÚÕ¼Áì¹ãÖÝºÍÎ§¼ß°×³çìû²¿µÄµç±¨ Ê®ÔÂÊ®¶þÈÕ£© £¶ ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £´ £²

¹ØÓÚ²ÝÄâ»ª¶«¾üÕþÎ¯Ô±»áÃûµ¥¸ø³ÂÒãµÄÐÅ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®¶þÈÕ£© ¡¡ £¸ ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £´ ÖÐÑë¹ØÓÚÃñ×å¾ü¸ÄÃûºÍ³ÉÁ¢ÐÂ½®·Ö¾ÖµÄµç±¨
£¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®¶þÈÕ£© ¡¡ £¹ ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £´ ×ª·¢ËÉ½-ÏØÕÙ¿ª¸÷½çÈËÃñ´ú±í»áÒé¾-ÑéµÄµç±¨ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÈýÈÕ£© ¡¡ £± ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £µ ¹ØÓÚÎ÷ÄÏ¡¢ Î÷±±×÷Õ½²¿Êð¸øÅíµÂ»³µÄµç±¨ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÈýÈÕ£© ¡¡ £´ ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £µ £¨ Ò»¾ÅËÄ¾ÅÄê ¾üÎ¯¹ØÓÚ²»Ê¹¹ã¶«µÐ¾üÌÓÈë¹ãÎ÷µÄµç±¨ ¡¡Ê®ÔÂÊ®ÈýÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £µ £¶ ÔÚ±íÑï¼ßÃð°×³çìûÖ÷Á¦µÄ²¿¶ÓµÄµç±¨ÉÏµÄÅúÓï £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÈýÈÕ£© ¡¡ £¸ ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £µ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÈýÈÕ£© ¸ø·ëÓÑÀ¼µÄÐÅ £¹ ¡-¡-¡-¡-¡-¡-¡-¡- £µ £¨ Ò»¾ÅËÄ¾ÅÄê ¸øÉÏº£ÊÐÖ½Òµ¸ïÐÂ´Ù½ø»áµÄÌâ´Ê ¡¡Ê®ÔÂÊ®ÈýÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £¶ £° £¨ Ò»¾ÅËÄ¾ÅÄê ÎªÁË½âÂÞÕÂÁúµÄÇé¿ö¸øºþÄÏÊ¡Î¯µÄµç±¨ ¡¡Ê®ÔÂÊ®ËÄÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £¶ £± ÖÐÑë¹ØÓÚ·¢±í¹ãÖÝ¾ü¹Ü»áºÍÊÐÕþ¸®¾ÍÖ°²¼¸æµÄ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÎåÈÕ£© ¡¡µç±¨ £² ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £¶ ÖÐÑë¹ØÓÚÐÂ½®ÈýÇø´ú±íÍ¬ÅíµÂ»³»áÌ¸ÎÊÌâµÄµç±¨ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÎåÈÕ£© ¡¡ £³ ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £¶ ¾üÎ¯¹ØÓÚÍ¬Òâ·Ö²½ÖèÔÚÐÂ½®½øÐÐ¾üÊÂ¹¤×÷ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÎåÈÕ£© ¡¡¸øÅíµÂ»³µÈµÄµç±¨ £µ ¡-¡-¡-¡-¡- £¶ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÎåÈÕ£© ¸øÕÅÖÙÊµµÄÐÅ £· ¡-¡-¡-¡-¡-¡-¡-¡- £¶ £³

£¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÎåÈÕ£© £¸ ¸øÎÀÁ¢»ÍµÄµç±¨ ¡-¡-¡-¡-¡-¡-¡- £¶ £¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÎåÈÕ£© ¸øÖÜÊÀîÈµÄÐÅ £¹ ¡-¡-¡-¡-¡-¡-¡-¡- £¶

½ÓÊÜËÕÁª×¤»ª´óÊ¹ÂÞÉê³ÊµÝ¹úÊéÊ±µÄ´ð´Ê
£¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®ÁùÈÕ£© ¡¡ £± ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £· £¨ Ò»¾ÅËÄ¾ÅÄê ×£ºØµÂÒâÖ¾ÃñÖ÷¹²ºÍ¹ú³ÉÁ¢µÄµç±¨ ¡¡Ê®ÔÂÊ®ÁùÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £· £² £¨ Ò»¾ÅËÄ¾ÅÄê ¹ØÓÚËÄ±øÍÅµÄ×÷Õ½·½Ïò¸øÁÖ±ëµÄµç±¨ ¡¡Ê®ÔÂÊ®ÆßÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £· £´ £¨ Ò»¾ÅËÄ¾ÅÄê ¹ØÓÚÎ÷ÄÏµØÇøµÄ×÷Õ½·½Õë¸øÁÖ±ëµÄµç±¨ ¡¡Ê®ÔÂÊ®¾ÅÈÕ£© ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £· £µ

¹ØÓÚ¸ßÁèÔÆÊ¦ÓëÉÂ±±ÒÁÃË²¿¶ÓºÏ±àµÄµç±¨
£¨ Ò»¾ÅËÄ¾ÅÄêÊ®ÔÂÊ®¾ÅÈÕ£© ¡¡ £¸ ¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡-¡- £·";



//badCodeTest($test,20,5);
//
//function badCodeTest($string,$number=10,$limit=5){
//	$badcode=0;
//	$testArr=str_split($string,$number);
//	$testStr=$testArr[0];
//	$json=json_encode($testStr);
//	print_r($json);
//	
//	$badcode=preg_match("/\u00/", $json);
//	
//	print_r($badcode) ;
//	
//	return $badcode>=$limit ? FALSE : TRUE ;
//}
?>